
# coding: utf-8

# In[1]:


from newspaper import Article
import csv
import pandas as pd
import numpy as np
import random
import nltk
from wordcloud import WordCloud
from wordcloud import STOPWORDS
import matplotlib.pyplot as plt
import matplotlib.pyplot as plt
import platform
from konlpy.corpus import kolaw
from konlpy.tag import Twitter; t=Twitter()
import pandas as pd
import gensim
import statistics
from nltk.corpus import wordnet as wn
from nltk.util import ngrams
from textblob.tokenizers import word_tokenize
from gensim.models import Phrases
from gensim.models.phrases import Phraser
nltk.download('punkt')
nltk.download('wordnet')
import pickle
import pyLDAvis.gensim


# In[2]:


data1=pd.read_excel('seoul.xls')
data1=[data1]
datasize=0
for i in data1:
    datasize+=len(i)
print('데이터수 : ', datasize)


# In[3]:


print(data1)


# In[4]:


URL=[]
for i in data1:
    for j in i['URL']:
        URL.append(j)


# In[ ]:


tp=0
NEWS=[]
for i in range(0,len(URL)):
    try:
        a = Article(URL[i], language='ko')
        a.download()
        a.parse()
    except:
        tp+=1
    else:
        NEWS.append(a.text)
print(NEWS)


# In[ ]:


print(len(NEWS))


# # 워드클라우드

# In[ ]:


stop_words = ['를','기자','말','것','이','그','내','그녀','책','더','나','수','대한','알','때','리','위','속','중','곳','때문','무엇','전','위해','등','고','명','통해',
             '의','개','및','로','지난','진행','이번','분야','며','경우','최근','은','지난해','현재','시작','지원','이상','가장','또','설명','기존','올해','점','예정','출시',
                 '정도','팀','시간','기반','대해','뒤','우리','과정','적용','대상','공개','다른','모두','과','도','방식','후','달','확인','안','라며','건','이후','생각',
                 '상황','내용','데','수준','앞','사실','자신','직접','날','결과','게','참여','실제','모든','처음','한편','도입','하나','제','해당','기준','포함','지금',
                 '모습','기록','이유','중심','아이','방법','또한','가지','변화','관심','전망','추가','볼','최대','전체','씨','선택','조선_비즈','그룹','행사','제작','매출',
                 '생산','시','선정','가능성','면서','총','규모','구성','지속','역시','전문','보고','일부','부문','개인','소개','강조','공유','상태','형태','의미','용',
                 '일반','가운데','단계','자체','여러','주요','두','당시','각각','부분','더욱','증가','해','공간','역할','수도','바','비','최고','번','바로','인기',
                 '중이','만큼','이름','사이','노력','구축','영향','물','별','첫','화면','첫','간','비롯','탑재','지난달','목표','구매','대부분','거나','개선','준비','확보',
                 '주','등장','핵심','발견','발전','성과','글','현장','배','작업','외','물질','동안','마련','다시','내년','뿐','계속','주목','온','지적','이야기','비교','인',
                 '집중','도움','부담','보유','장','필요','못','줄','능력','비용','위치','세','추진','앞서','관','성장','각종','여기','동시','각','크게','통한','반응','결정',
                 '대신','손','대비','향후','기간','세대','존재','선','원','인식','새','매우','바탕','달리','영역','차지','여','사례','상용','하루','종','기본','적극',
                 '구현','크기','기','누구','이하','임','특정','인증','로부터','이전','감소','전국']
text_data=[]
for line in NEWS:
    tokens=t.nouns(line)
    tokens=[each_word for each_word in tokens if each_word not in stop_words]
    text_data.append(tokens)


# In[ ]:


# bigram
phrases = Phrases(text_data)
bigram = Phraser(phrases)


# In[ ]:


n=0
for doc in text_data:
    text_data[n]=bigram[doc]
    n+=1


# In[ ]:


stop_words = ['를','기자','말','것','이','그','내','그녀','책','더','나','수','대한','알','때','리','위','속','중','곳','때문','무엇','전','위해','등','고','명','통해',
             '의','개','및','로','지난','진행','이번','분야','며','경우','최근','은','지난해','현재','시작','지원','이상','가장','또','설명','기존','올해','점','예정','출시',
                 '정도','팀','시간','기반','대해','뒤','우리','과정','적용','대상','공개','다른','모두','과','도','방식','후','달','확인','안','라며','건','이후','생각',
                 '상황','내용','데','수준','앞','사실','자신','직접','날','결과','게','참여','실제','모든','처음','한편','도입','하나','제','해당','기준','포함','지금',
                 '모습','기록','이유','중심','아이','방법','또한','가지','변화','관심','전망','추가','볼','최대','전체','씨','선택','조선_비즈','그룹','행사','제작','매출',
                 '생산','시','선정','가능성','면서','총','규모','구성','지속','역시','전문','보고','일부','부문','개인','소개','강조','공유','상태','형태','의미','용',
                 '일반','가운데','단계','자체','여러','주요','두','당시','각각','부분','더욱','증가','해','공간','역할','수도','바','비','최고','번','바로','인기',
                 '중이','만큼','이름','사이','노력','구축','영향','물','별','첫','화면','첫','간','비롯','탑재','지난달','목표','구매','대부분','거나','개선','준비','확보',
                 '주','등장','핵심','발견','발전','성과','글','현장','배','작업','외','물질','동안','마련','다시','내년','뿐','계속','주목','온','지적','이야기','비교','인',
                 '집중','도움','부담','보유','장','필요','못','줄','능력','비용','위치','세','추진','앞서','관','성장','각종','여기','동시','각','크게','통한','반응','결정',
                 '대신','손','대비','향후','기간','세대','존재','선','원','인식','새','매우','바탕','달리','영역','차지','여','사례','상용','하루','종','기본','적극',
                 '구현','크기','기','누구','이하','임','특정','인증','로부터','이전','감소','전국',
             '기술','서비스','기업','개발','한국','제공','국내','사용','연구','사람','이용','사업','제품','전자','정보','게임','미국','관련','세계',
             '시장','활용','대표','중국','기능','업체','스마트폰','고객','시스템','산업','계획','콘텐츠','투자','사진','분석','영상','문제',
             '운영','센터','일','프로그램','관계자','발표','조사','사용자','미래','평가','지역','관리','이용자','효과','발생','활동','확대','직원','국가','전문가',
             '협력','학생','업계','시대','서울','기관','눈','예상','경험','다음','이익_순이익','국제','속도','경쟁','거래','설치','현지','기기','연구원','프로젝트',
             '영업_이익','자료','요구','박사','서비스_제공','규제','연구소','초','구조','주장','자리','유지','업무','연결','효율','종고차_마법','누적_영업','가치',
             '장비','사업자','학습','평균','먼저','만','영국','반면','현상','설립','돈','특징','이해','성공','우리나라','성능','오후','방문','몸','전달','통합','파악',
             '입장','역량','시험','사','명의','뜻','별로','기도','개월','공동','대응','이제','판단','최초','처리','힘','제도','회장','사장','다만','스스로','층',
             '출처_동아','본격','기대','측은','부','조직','사기','라면','목적','댓글','우선','공급','단','과거','정','사이트','제한','거리','신규','유럽','기사','대화',
             '개최','생활','체계','보도','내부','우려','고려','시설','채널','외부','주로','세상','별도','강화','진출','해결','주제','기회','논란','특성','김','경쟁력',
             '거','전용','국민','살','등록','중인','거의','생','대형','주변','분','표현','초기','보고서','이동','담당','시스템_한국','년','이벤트','종합','셈','가족',
             '제시','독자','홍보','신청','작년','설정','금융감동원_자공시','기사_국민일보','시도','관계','투자자','적','토대_작성','엠로보_개발','증권_뉴스','전용_인공',
             '거래소_데이터','함','친구','측정','서로','용량','검사','그동안','인수','빛','원장','방침','방','실시','장점','과학자','활성화','예','양','얼굴','장기',
             '고민','안정','여부','늘','영업','수요','제대로','소통','관측','사건','아이디어','신뢰','개념','실적','경영','차이','부품','망','협회','무료','전기','재',
             '공격','오전','수익','신제품','교수','소비자','브랜드','일본','회사','글로벌','혁신','네이버','해외','전략','상품','구글','삼성_전자','가격','모델']


# In[ ]:


ff=0
tokens_ko=[]
for i in text_data:
    for j in i:
        if j not in stop_words:
            tokens_ko.append(j)
        else:
            ff+=1
ko = nltk.Text(tokens_ko, name='뉴스기사_100편')
ko.vocab().most_common(1000)


# In[ ]:


font_path='/usr/share/fonts/truetype/nanum/NanumMyeongjo.ttf'
data=ko.vocab().most_common(500)
tmp_data=dict(data)
wordcloud=WordCloud(font_path=font_path, relative_scaling=0.2, background_color="white").generate_from_frequencies(tmp_data)
plt.figure(figsize=(12,8))
plt.imshow(wordcloud)
plt.axis("off")
plt.show()


# In[ ]:


tt=[]
pp=['서울']
stop=['사고','안전','기업','기술','관련','공단','저희','사람','업무','사업','정부','개발','정책','시스템','발생','훈련','회사','차_산업혁명','관리',
     '건물','시설','관계자','지역','활용','운영','계획','산업','한국','센터','대응','대학','서울','시장','이용','기관','문제','제공','사회','본부','확대','파악',
     '국내','직원','투입','대표','과장','체계','앵커','업체','투자','부산','아레나','규제','기능','국가','혁신','연구원','대형','통신_구','우리나라','대책','서울시','미래','유_시스']
num=0
ccn=[]
ccnn=[]
number=0
for i in text_data:
    nu=0
    mu=0
    for p in tt:
        if p in i:
            nu+=1
    for q in pp:
        if q in i:
            mu+=1
    if nu>=1 or mu>=1:
        ccn.append(i)
        ccnn.append(number)
    num+=1
    number+=1
tokens_ko=[]
ff=0
for i in ccn:
    for j in i:
        if len(j)>1 and j not in stop:
       # if len(j)>1 and j not in tt and j not in pp and j not in stop:
            tokens_ko.append(j)
        else:
            ff+=1
ko = nltk.Text(tokens_ko, name='뉴스기사_10,200편')
ko.vocab().most_common(100)


# In[ ]:


print(len(ccn))
print(ccn[0])


# In[ ]:


font_path='/usr/share/fonts/truetype/nanum/NanumMyeongjo.ttf'
data=ko.vocab().most_common(500)
tmp_data=dict(data)
wordcloud=WordCloud(font_path=font_path, relative_scaling=0.2, background_color="white").generate_from_frequencies(tmp_data)
plt.figure(figsize=(12,8))
plt.imshow(wordcloud)
plt.axis("off")
plt.show()


# In[ ]:


print(text_data[0])


# # 토픽 모델링

# In[ ]:


dictionary = gensim.corpora.Dictionary(text_data)
print("Number of words in dictionary:",len(dictionary))
for i in range(len(dictionary)):
    print(i, dictionary[i])
    
coo = ['를','기자','말','것','이','그','내','그녀','책','더','나','수','대한','알','때','리','위','속','중','곳','때문','무엇','전','위해','등','고','명','통해',
             '의','개','및','로','지난','진행','이번','분야','며','경우','최근','은','지난해','현재','시작','지원','이상','가장','또','설명','기존','올해','점','예정','출시',
                 '정도','팀','시간','기반','대해','뒤','우리','과정','적용','대상','공개','다른','모두','과','도','방식','후','달','확인','안','라며','건','이후','생각',
                 '상황','내용','데','수준','앞','사실','자신','직접','날','결과','게','참여','실제','모든','처음','한편','도입','하나','제','해당','기준','포함','지금',
                 '모습','기록','이유','중심','아이','방법','또한','가지','변화','관심','전망','추가','볼','최대','전체','씨','선택','조선_비즈','그룹','행사','제작','매출',
                 '생산','시','선정','가능성','면서','총','규모','구성','지속','역시','전문','보고','일부','부문','개인','소개','강조','공유','상태','형태','의미','용',
                 '일반','가운데','단계','자체','여러','주요','두','당시','각각','부분','더욱','증가','해','공간','역할','수도','바','비','최고','번','바로','인기',
                 '중이','만큼','이름','사이','노력','구축','영향','물','별','첫','화면','첫','간','비롯','탑재','지난달','목표','구매','대부분','거나','개선','준비','확보',
                 '주','등장','핵심','발견','발전','성과','글','현장','배','작업','외','물질','동안','마련','다시','내년','뿐','계속','주목','온','지적','이야기','비교','인',
                 '집중','도움','부담','보유','장','필요','못','줄','능력','비용','위치','세','추진','앞서','관','성장','각종','여기','동시','각','크게','통한','반응','결정',
                 '대신','손','대비','향후','기간','세대','존재','선','원','인식','새','매우','바탕','달리','영역','차지','여','사례','상용','하루','종','기본','적극',
                 '구현','크기','기','누구','이하','임','특정','인증','로부터','이전','감소','전국',
             '기술','서비스','기업','개발','한국','제공','국내','사용','연구','사람','이용','사업','제품','전자','정보','게임','미국','관련','세계',
             '시장','활용','대표','중국','기능','업체','스마트폰','고객','시스템','산업','계획','콘텐츠','투자','사진','분석','영상','문제',
             '운영','센터','일','프로그램','관계자','발표','조사','사용자','미래','평가','지역','관리','이용자','효과','발생','활동','확대','직원','국가','전문가',
             '협력','학생','업계','시대','서울','기관','눈','예상','경험','다음','이익_순이익','국제','속도','경쟁','거래','설치','현지','기기','연구원','프로젝트',
             '영업_이익','자료','요구','박사','서비스_제공','규제','연구소','초','구조','주장','자리','유지','업무','연결','효율','종고차_마법','누적_영업','가치',
             '장비','사업자','학습','평균','먼저','만','영국','반면','현상','설립','돈','특징','이해','성공','우리나라','성능','오후','방문','몸','전달','통합','파악',
             '입장','역량','시험','사','명의','뜻','별로','기도','개월','공동','대응','이제','판단','최초','처리','힘','제도','회장','사장','다만','스스로','층',
             '출처_동아','본격','기대','측은','부','조직','사기','라면','목적','댓글','우선','공급','단','과거','정','사이트','제한','거리','신규','유럽','기사','대화',
             '개최','생활','체계','보도','내부','우려','고려','시설','채널','외부','주로','세상','별도','강화','진출','해결','주제','기회','논란','특성','김','경쟁력',
             '거','전용','국민','살','등록','중인','거의','생','대형','주변','분','표현','초기','보고서','이동','담당','시스템_한국','년','이벤트','종합','셈','가족',
             '제시','독자','홍보','신청','작년','설정','금융감동원_자공시','기사_국민일보','시도','관계','투자자','적','토대_작성','엠로보_개발','증권_뉴스','전용_인공',
             '거래소_데이터','함','친구','측정','서로','용량','검사','그동안','인수','빛','원장','방침','방','실시','장점','과학자','활성화','예','양','얼굴','장기',
             '고민','안정','여부','늘','영업','수요','제대로','소통','관측','사건','아이디어','신뢰','개념','실적','경영','차이','부품','망','협회','무료','전기','재',
             '공격','오전','수익','신제품','교수','소비자','브랜드','일본','회사','글로벌','혁신','네이버','해외','전략','상품','구글','삼성_전자','가격','모델'] 
stoplist = coo
stop_ids = [dictionary.token2id[stopword] for stopword in stoplist if stopword in dictionary.token2id]
dictionary.filter_tokens(stop_ids)
dictionary.compactify()
print("Number of words in dictionary:",len(dictionary))
for i in range(len(dictionary)):
    print(i, dictionary[i])


# In[ ]:


corpus = [dictionary.doc2bow(data) for data in text_data]
print(corpus)
import pickle
pickle.dump(corpus, open("corpus.pkl", "wb"))
dictionary.save('dictionary.gensim')
tf_idf = gensim.models.TfidfModel(corpus)
sims = gensim.similarities.Similarity('./',tf_idf[corpus],num_features=len(dictionary))


# In[ ]:


NUM_TOPICS = 50
ldamodel = gensim.models.ldamodel.LdaModel(corpus, num_topics=NUM_TOPICS, id2word=dictionary, alpha=0.1, passes =100)
ldamodel.save('model80.gensim')
topics = ldamodel.print_topics(num_words=7)
for topic in topics:
    print(topic)


# In[ ]:


# circle size : importance of topic
import pickle
import pyLDAvis.gensim

dictionary = gensim.corpora.Dictionary.load('dictionary.gensim')
corpus = pickle.load(open("corpus.pkl", "rb"))
lda = gensim.models.ldamodel.LdaModel.load('model80.gensim')

lda_display = pyLDAvis.gensim.prepare(lda,corpus,dictionary,sort_topics=False)
pyLDAvis.display(lda_display)

